In [1]:
#create database fita
#create table fita.emp(id varchar(255) , name varchar(255) , salary varchar(255))
#insert into fita.emp(id , name , salary) value("1","kumar","100")
#insert into fita.emp(id , name , salary) value("2","arun","200")
#select * from fita.emp

In [2]:
from sqlalchemy import create_engine

import pymysql

import pandas as pd

In [3]:
sqlEngine       = create_engine("mysql+pymysql://root:root_12345@localhost:3306", pool_recycle=3600)

In [4]:
dbConnection    = sqlEngine.connect()

In [5]:
frame           = pd.read_sql("select * from fita.emp", dbConnection)

In [6]:
frame

  id   name salary
0  1  kumar    100
1  2  Rohit    200

In [7]:
frame['name'] = frame['name'].replace(["Rohit"],"kishore")

In [8]:
frame

  id     name salary
0  1    kumar    100
1  2  kishore    200

In [8]:
frame.to_sql(con=dbConnection, schema = "fita" , name='emp', if_exists='replace', index=False)

In [9]:
frame.to_sql(con=dbConnection, schema = "fita" , name='emp', if_exists='append', index=False)